export const WAVELENGTH_INSTRUCTIONS = [
  {
    title: "Суть игры",
    content: "Один игрок (Психолог) видит скрытую цель на шкале между двумя противоположностями и дает подсказку."
  },
  {
    title: "Начисление очков",
    content: "Чем ближе догадка команды к цели на шкале, тем больше очков они получают!"
  }
];

export const WAVELENGTH_DATA_BY_DIFFICULTY = {
  easy: [
    ["Холодное", "Горячее"],
    ["Маленькое", "Огромное"],
    ["Слабое", "Сильное"],
    ["Темное", "Светлое"],
    ["Тихое", "Громкое"],
    ["Медленное", "Быстрое"],
    ["Дешевое", "Дорогое"]
  ],
  medium: [
    ["Бесполезное", "Полезное"],
    ["Скучное", "Интересное"],
    ["Плохое", "Хорошее"],
    ["Страшное", "Смешное"],
    ["Грустное", "Веселое"],
    ["Обычное", "Экзотическое"],
    ["Старое", "Новое"]
  ],
  hard: [
    ["Этический", "Неэтичный"],
    ["Недооцененный", "Переоцененный"],
    ["Запретный плод", "Повседневность"],
    ["Человеческая природа", "Искусственное"],
    ["Духовное", "Материальное"],
    ["Хаос", "Порядок"],
    ["Свобода", "Ответственность"]
  ]
};

export const WAVELENGTH_CATEGORIES = [
  ...WAVELENGTH_DATA_BY_DIFFICULTY.easy,
  ...WAVELENGTH_DATA_BY_DIFFICULTY.medium,
  ...WAVELENGTH_DATA_BY_DIFFICULTY.hard
];
